# https://github.com/Homebrew/homebrew-bundle
# In order to speed the initial bootstrap process, this Brewfile only installs
# essentials. A more complete Brewfile is symlinked to the home directory when
# the dotfiles are installed. After the initial bootstrap is complete, run
# `brew bundle install --global`

tap "caskroom/cask"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/services"
tap "homebrew/versions"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"

# Homebrew
# https://github.com/Homebrew/brew/
brew "bash-completion"
brew "coreutils"
brew "ctags"
brew "dockutil"
brew "git"
brew "homebrew/dupes/rsync"
brew "htop"
brew "hub"
brew "libyaml"
brew "mas"
brew "openssl"
brew "postgresql", service_restart: true
brew "python"
brew "qt@5.5" if MacOS::Xcode.installed?
brew "readline"
brew "reattach-to-user-namespace"
brew "spark"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "thoughtbot/formulae/gitsh"
brew "tmux"
brew "tree"
brew "universal-ctags", args: ["HEAD"]
brew "vim"
brew "wget"
brew "yarn"
brew "zsh"

# homebrew-cask
# https://github.com/caskroom/homebrew-cask
cask "dropbox"
cask "fantastical"
cask "google-chrome"
cask "gpg-suite"
cask "iterm2"
cask "postico"
cask "skype"

# mas-cli
# https://github.com/argon/mas
mas "1Password", id: 443987910
mas "Evernote", id: 406056744
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Things3", id: 904280696
mas "Tweetbot", id: 557168941
