# https://github.com/Homebrew/homebrew-bundle
# In order to speed the initial bootstrap process, this Brewfile only installs
# essentials. A more complete Brewfile is symlinked to the home directory when
# the dotfiles are installed. After the initial bootstrap is complete, run
# `brew bundle install --global`

tap "caskroom/cask"
tap "goles/battery"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/services"
tap "homebrew/versions"
tap "thoughtbot/formulae"

# Homebrew
# https://github.com/Homebrew/brew/
brew "openssl"
brew "libyaml"
brew "bash-completion"
brew "ctags"
brew "dockutil"
brew "git"
brew "htop"
brew "perl"
brew "imagemagick"
brew "mas"
brew "readline"
brew "python"
brew "postgresql", service_restart: true
brew "pgcli"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redis", service_restart: true
brew "ruby"
brew "spark"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "zsh"
brew "goles/battery/battery"
brew "homebrew/dupes/rsync"
brew "thoughtbot/formulae/gitsh"

# homebrew-cask
# https://github.com/caskroom/homebrew-cask
cask "dropbox"
cask "fantastical"
cask "google-chrome"
cask "hipchat"
cask "iterm2"
cask "skype"

# mas-cli
# https://github.com/argon/mas
mas "Evernote", id: 406056744
mas "1Password", id: 443987910
mas "Tweetbot", id: 557168941
mas "OmniFocus", id: 867299399
