tap "caskroom/cask"
tap "goles/battery"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/services"
tap "homebrew/versions"
tap "thoughtbot/formulae"

brew "pkg-config"
brew "openssl"
brew "libyaml"
brew "ansible"
brew "autoconf"
brew "awscli"
brew "bash-completion"
brew "cloc"
brew "cmatrix"
brew "ctags"
brew "dockutil"
brew "xz"
brew "gettext"
brew "dos2unix"
brew "doxygen"
brew "figlet"
brew "libpng"
brew "freetype"
brew "gdbm"
brew "pcre"
brew "git"
brew "libffi"
brew "glib"
brew "htop"
brew "hub"
brew "libtool"
brew "jpeg"
brew "libtiff"
brew "perl"
brew "imagemagick"
brew "libevent"
brew "libssh2"
brew "mas"
brew "s-lang"
brew "midnight-commander"
brew "namebench"
brew "readline"
brew "sqlite"
brew "python"
brew "postgresql", service_restart: true
brew "pgcli"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redis", service_restart: true
brew "ruby"
brew "selenium-server-standalone"
brew "spark"
brew "speedtest_cli"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "tmux"
brew "trash"
brew "tree"
brew "unixodbc"
brew "vim"
brew "wget"
brew "zsh"
brew "goles/battery/battery"
brew "homebrew/dupes/rsync"
brew "homebrew/versions/qt55"
brew "thoughtbot/formulae/gitsh"

# cask "alfred"
cask "applepi-baker"
cask "atom"
cask "bartender"
# cask "carbon-copy-cloner"
cask "daisydisk"
cask "dropbox"
cask "fantastical"
cask "firefox"
cask "google-chrome"
cask "google-drive"
cask "hazel"
cask "hipchat"
cask "istat-menus"
cask "iterm2"
cask "little-snitch"
cask "namebench"
cask "ngrok"
cask "opera"
cask "postico"
cask "screenflick"
cask "sketch"
cask "skype"
cask "the-unarchiver"
cask "vagrant"
cask "virtualbox"
cask "vlc"

mas "WiFi Explorer", id: 494803304
